routes/web.php

select `articles`.`article_id`, `articles`.`author_id`, `authors`.* from `articles` inner join `authors` on `articles`.`author_id` = `authors`.`author_id` where `articles`.`status` = 'p' group by `authors`.`author_id`, `articles`.`article_id` order by `articles`.`article_id` desc limit 5
select count(*) as aggregate from `articles` where `articles`.`status` = 'p'
select count(*) as aggregate from `photos` where `photos`.`valid` = '1'
select count(*) as aggregate from `youtubevideo`
---
/*live data*/
route::auth();
Route::get('/dashboard', ['middleware' => 'auth',   'uses' => function () {
$posts = DB::table('articles')
        ->join('authors', 'articles.author_id', '=', 'authors.author_id')
        ->select('articles.article_id','articles.author_id','authors.*'  )
        ->where('articles.status', '=', 'p')
        ->orderBy('articles.article_id', 'desc')
        ->groupBy('authors.author_id','articles.article_id')
        ->take(5)->get();

 $article_publish = DB::table('articles')
         ->select('articles.*')
         ->where('articles.status', '=', 'p')
         ->count();
 $photos_publish = DB::table('photos')
         ->select('photos.*')
         ->where('photos.valid', '=', '1')
         ->count();
 $videos_publish = DB::table('youtubevideo')
         ->select('youtubevideo.*')
         ->count();