app/Http/Controllers/Index/IndexpageController.php

    public function __construct()
    {
        if (Cache::has('menus')) {
            $menus= Cache::get('menus');
        }else{
            $menus = Menu::with('children')->where([['valid','1'],['is_homepage','1']])->orderby('sequence','asc')->get();
            Cache::put('menus', $menus, 20);
        };
        if (Cache::has('industryBriefing')) {
            $industryBriefing= Cache::get('industryBriefing');
        }else{
            $industryBriefing = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','url','photopath','phototitle','category_name')->where('category_id',3)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 3 order by `publish_date` desc, `publish_time` desc limit 4

    public function index(Request $request)
    {

        if (Cache::has('homeSlide')) {
            $homeSlide= Cache::get('homeSlide');
        }else{
        	$homeSlide = DB::table('article')->select('title','url','photopath','phototitle','category_name')->where('important', 1)->where('priority','!=', 0)->orderby('priority','asc')->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();
        	Cache::put('homeSlide', $homeSlide, 20);
        };


        if (Cache::has('mediaForum')) {
            $mediaForum= Cache::get('mediaForum');
        }else{
            $mediaForum = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','url','category_name')->where('category_id',4)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();
            Cache::put('mediaForum', $mediaForum, 20);
        };
        if (Cache::has('jobs')) {
            $jobs= Cache::get('jobs');
        }else{
            $jobs = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',7)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();
            Cache::put('jobs', $jobs, 20);
        };
        if (Cache::has('mostRead')) {
            $mostRead= Cache::get('mostRead');
        }else{
            $mostRead = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',9)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(3)->get();
---
select `title`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `important` = 1 and `priority` != 0 order by `priority` asc, `publish_date` desc, `publish_time` desc limit 4
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `url`, `category_name` from `article` where `category_id` = 4 order by `publish_date` desc, `publish_time` desc limit 4
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 7 order by `publish_date` desc, `publish_time` desc limit 4

        if (Cache::has('interview')) {
            $interview= Cache::get('interview');
        }else{
            $interview = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',5)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(2)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 9 order by `publish_date` desc, `publish_time` desc limit 3

        if (Cache::has('vicharmanch')) {
            $vicharmanch= Cache::get('vicharmanch');
        }else{
            $vicharmanch = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',11)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(2)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 5 order by `publish_date` desc, `publish_time` desc limit 2

        if (Cache::has('Adv')) {
            $Adv= Cache::get('Adv');
        }else{
            $Adv = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',8)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(3)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 66 order by `publish_date` desc, `publish_time` desc limit 3

        if (Cache::has('mainNews')) {
            $mainNews= Cache::get('mainNews');
        }else{
            $mainNews = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',6)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(6)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 6 order by `publish_date` desc, `publish_time` desc limit 6

        if (Cache::has('socialM')) {
            $socialM= Cache::get('socialM');
        }else{
            $socialM = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',13)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(10)->get();
---
select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 10 order by `publish_date` desc, `publish_time` desc limit 10

    public function Article_landing_page($section,$title,$id)
    {

                if (Cache::has('articles-'.$id)) {
                $articles= Cache::get('articles-'.$id);
                }else{
                $articles = Article::select('*')->where('article_id',$id)->get();
---
select * from `article` where `article_id` = '49523'