app/Http/Controllers/Index/IndexpageController.php

select CONCAT(publish_date,publish_time) AS pickdate, `title`, `summary`, `url`, `photopath`, `phototitle`, `category_name` from `article` where `category_id` = 13 order by `publish_date` desc, `publish_time` desc limit 10
---
    public function __construct()
    {
        if (Cache::has('menus')) {
            $menus= Cache::get('menus');
        }else{
            $menus = Menu::with('children')->where([['valid','1'],['is_homepage','1']])->orderby('sequence','asc')->get();
            Cache::put('menus', $menus, 20);
        };
        if (Cache::has('industryBriefing')) {
            $industryBriefing= Cache::get('industryBriefing');
        }else{
            $industryBriefing = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','url','photopath','phototitle','category_name')->where('category_id',3)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(4)->get();
            Cache::put('industryBriefing', $industryBriefing, 20);
        };
        if (Cache::has('socialM')) {
            $socialM= Cache::get('socialM');
        }else{
            $socialM = Article::select(DB::raw('CONCAT(publish_date,publish_time) AS pickdate'),'title','summary','url','photopath','phototitle','category_name')->where('category_id',13)->orderby('publish_date','desc')->orderby('publish_time','desc')->limit(10)->get();