app/Http/Controllers/ArticlesController.php

            return redirect('/dashboard');
        /* Right mgmt end */
        $editor = '';
        $newstype = DB::table('news_type')->where('valid', '1')->get();
---
select * from `news_type` where `valid` = '1'

                }
            }
            $articles = $q->groupBy('articles.article_id')->paginate(config('constants.recordperpage'));
            $editor = DB::table('users')
                    ->join('articles', 'users.id', '=', 'articles.locked_by')
                    ->select('users.name', 'articles.article_id')
                    ->where('status', $status)
                    ->get();

        }
        $data  = DB::table('article_feature')
                    ->select(DB::raw('article_feature.*'))
                    ->orderby('sequence','asc')->orderby('publish_date','desc')->limit(100)->get();
---
select `users`.`name`, `articles`.`article_id` from `users` inner join `articles` on `users`.`id` = `articles`.`locked_by` where `status` = 'P'
select article_feature.* from `article_feature` order by `sequence` asc, `publish_date` desc limit 100

          if (count($data) > 0) {
              return view('articles.' . $option, compact('articles','data','articlestop', 'editor', 'channels', 'currentChannelId','newstype','selectedNewType'));
          }else{
             $data  = DB::table('article_feature')
                    ->select(DB::raw('article_feature.*'))
                    ->orderby('sequence','asc')->orderby('publish_date','desc')->limit(100)->get();
---
select article_feature.* from `article_feature` order by `sequence` asc, `publish_date` desc limit 100

    public function create() {

        if (!Session::has('users')) {
            return redirect()->intended('/auth/login');
        }
        $uid = Session::get('users')->id;
        /* Right mgmt start */
        $rightId = 2;
        $currentChannelId = $this->rightObj->getCurrnetChannelId($rightId);
        $channels = $this->rightObj->getAllowedChannels($rightId);
        if (!$this->rightObj->checkRights($currentChannelId, $rightId))
            return redirect('/dashboard');
        /* Right mgmt end */
        $postAs = AuthorType::where('valid', '=', '1')->orderBy('label')->get();
        $p1 = DB::table('author_type')->where('valid', '1')->pluck('label', 'author_type_id');
        //$country = Country::where('valid', '=', '1')->get();
        //$states = State::where('valid', '=', '1')->orderBy('name')->get();
        $newstype = DB::table('news_type')->where('valid', '1')->get();
        $category = DB::table('category')->where('valid', '1')->where('parent_id','0')->orderBy('name')->get();
        $album = DB::table('album')->orderBy('id','desc')->get();
         $whatsup = DB::table('tbl_whatsapp_article')->select(DB::raw('count(id) as cn'),'publish_date','publish_time')->where('publish_date',date('Y-m-d'))->first();
---
select * from `author_type` where `valid` = '1' order by `label` asc
select `label`, `author_type_id` from `author_type` where `valid` = '1'
select * from `news_type` where `valid` = '1'
select * from `category` where `valid` = '1' and `parent_id` = '0' order by `name` asc
select * from `album` order by `id` desc
select count(id) as cn, `publish_date`, `publish_time` from `tbl_whatsapp_article` where `publish_date` = '2019-01-18' limit 1